In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import re
import seaborn

%matplotlib inline

On-Base Percentage (OBP) = Hits + Walks(BB) + Hit By Pitch(HBP) / At Bats(AB) + Walks + HBP + Sacrifice Flies

Note = Sacrifice Flies stats don't start until 1954.

Before that, SH = SF + Bunts

In [ ]:
column_index = [0, 3, 4]
salaries = pd.read_csv('data/Salaries.csv', usecols=column_index)

In [5]:
bio_master = pd.read_csv('data/Master.csv')
bio_master.head()

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,220.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,...,Aaron,Tommie Lee,190.0,75.0,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190.0,75.0,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184.0,73.0,L,L,2001-09-10,2006-04-13,abada001,abadan01

In [7]:
column_id = [0, 13, 14]
bio = pd.read_csv('data/Master.csv', usecols=column_id)
bio.head()

    playerID nameFirst nameLast
0  aardsda01     David  Aardsma
1  aaronha01      Hank    Aaron
2  aaronto01    Tommie    Aaron
3   aasedo01       Don     Aase
4   abadan01      Andy     Abad

In [14]:
bio = bio.rename(columns={'nameFirst': 'FirstName', 'nameLast': 'LastName'})

In [15]:
bio.head()

    playerID FirstName LastName
0  aardsda01     David  Aardsma
1  aaronha01      Hank    Aaron
2  aaronto01    Tommie    Aaron
3   aasedo01       Don     Aase
4   abadan01      Andy     Abad

In [17]:
column_id = [0, 3, 4]
salary = pd.read_csv('data/Salaries.csv', usecols=column_id)
salary.head()

   yearID   playerID  salary
0    1985  barkele01  870000
1    1985  bedrost01  550000
2    1985  benedbr01  545000
3    1985   campri01  633333
4    1985  ceronri01  625000

In [18]:
column_id = [0, 1, 5, 6]
fielding = pd.read_csv('data/Fielding.csv', usecols=column_id)
fielding.head()

    playerID  yearID POS   G
0  abercda01    1871  SS   1
1   addybo01    1871  2B  22
2   addybo01    1871  SS   3
3  allisar01    1871  2B   2
4  allisar01    1871  OF  29

In [20]:
column_id = [0, 1, 5, 6, 8, 15, 18, 20]
batting = pd.read_csv('data/Batting.csv', usecols=column_id)
batting.head()

    playerID  yearID   G     AB     H   BB  HBP  SF
0  abercda01    1871   1    4.0   0.0  0.0  NaN NaN
1   addybo01    1871  25  118.0  32.0  4.0  NaN NaN
2  allisar01    1871  29  137.0  40.0  2.0  NaN NaN
3  allisdo01    1871  27  133.0  44.0  0.0  NaN NaN
4  ansonca01    1871  25  120.0  39.0  2.0  NaN NaN

In [24]:
data = pd.merge(batting, bio)
data = pd.merge(data, fielding)
data = pd.merge(data, salary)
data.head()

,playerID,yearID,G,AB,H,BB,HBP,SF,FirstName,LastName,POS,salary
0,aasedo01,1986,66,NaN,NaN,NaN,NaN,NaN,Don,Aase,P,600000
1,aasedo01,1987,7,NaN,NaN,NaN,NaN,NaN,Don,Aase,P,625000
2,aasedo01,1988,35,NaN,NaN,NaN,NaN,NaN,Don,Aase,P,675000
3,aasedo01,1989,49,5.0,0.0,0.0,0.0,0.0,Don,Aase,P,400000
4,aardsda01,2004,11,0.0,0.0,0.0,0.0,0.0,David,Aardsma,P,300000

In [25]:
data_test = data.copy()

In [26]:
data_test.fillna(0)

,playerID,yearID,G,AB,H,BB,HBP,SF,FirstName,LastName,POS,salary
0,aasedo01,1986,66,0.0,0.0,0.0,0.0,0.0,Don,Aase,P,600000
1,aasedo01,1987,7,0.0,0.0,0.0,0.0,0.0,Don,Aase,P,625000
2,aasedo01,1988,35,0.0,0.0,0.0,0.0,0.0,Don,Aase,P,675000
3,aasedo01,1989,49,5.0,0.0,0.0,0.0,0.0,Don,Aase,P,400000
4,aardsda01,2004,11,0.0,0.0,0.0,0.0,0.0,David,Aardsma,P,300000
5,aardsda01,2007,25,0.0,0.0,0.0,0.0,0.0,David,Aardsma,P,387500
6,aardsda01,2008,47,1.0,0.0,0.0,0.0,0.0,David,Aardsma,P,403250
7,aardsda01,2009,73,0.0,0.0,0.0,0.0,0.0,David,Aardsma,P,419000
8,aardsda01,2010,53,0.0,0.0,0.0,0.0,0.0,David,Aardsma,P,2750000
9,aardsda01,2012,1,0.0,0.0,0.0,0.0,0.0,David,Aardsma,P,500000